import type { Character } from '@/types/content'

export const CHARACTERS: Character[] = [
  {
    id: 'sugar-tree',
    name: 'Цукрове дерево',
    role: 'Хранитель саду',
    description: 'Цілий рік дарує солодку вату найрізноманітніших кольорів.',
  },
  {
    id: 'bitter-choco',
    name: 'Гіркий Шоколад',
    role: 'Старійшина',
    description: 'Наймудріший мешканець королівства й охоронець давніх солодких таємниць.',
  },
  {
    id: 'sugar-queen',
    name: 'Цукрова Королева',
    role: 'Господиня балів',
    description: 'Ще ніхто не бачив солодшої усмішки й волосся з карамельних ниток.',
  },
  {
    id: 'sugar-thief',
    name: 'Цукровий злодій',
    role: 'Витівник',
    description: 'Краде солодощі так спритно, що з’являється дуже рідко.',
  },
  {
    id: 'mr-zefir',
    name: 'Пан Зефірка',
    role: 'Придворний чарівник',
    description: 'Карамельний чарівник, який здійснює найсолодші бажання.',
  },
]
